>>> 'Hello "World!" How are you?'  #স্ট্রিং সিঙ্গেল কোটেশনের ভিতর লিখলে কোন সমস্যা ছাড়াই সে স্ট্রিংএ 
'Hello "World!" How are you?"      # ডাবল কোটেশন ব্যবহার করা যাবে

>>> "I'm fine!"  # এরকম ভাবে ডাবল কোটেশনের স্ট্রিংয়ে সিঙ্গেল কোটেশন ব্যবহার করা যাবে! 
"I'm fine!"

>>> 'I'm fine!'              # সমস্যা হবে  সিঙ্গেল কোটেশনের স্ট্রিং এর ভিতর সিঙ্গেল কোটেশন ব্যবহার করতে গেলে
 File "<stdin>", line 1      # অথবা ডাবল কোটেশনের স্ট্রিং এর ভিতর ডাবল কোটেশন ব্যবহার করতে গেলে
    'I'm fine!'              # এক্ষেত্রে পাইথন ইন্টারপ্রেটার 'I'm fine!' এর প্রথম ' এর পর থেকে স্ট্রিং ধরা শুরু করে
       ^                     # এবং পরবর্তি ' এর জন্য অপেক্ষা করে, যখনই আবার ' পায় সেটাকেই স্ট্রিং এর শেষ ধরে নেয়
SyntaxError: invalid syntax  # সুতরাং এখানে শুধুমাত্র 'I' কে স্ট্রিং ধরা হয়েছে, এর পরের অংশ (m fine!') যেহেতু ভ্যালিড 
                             # পাইথন কমান্ড নয় তাই সেখানেই ইরর থ্রো করেছে... 
                             # ডাবল কোটেশনের ভিতরে ডাবল কটেশন দিলেও একই কারনে এরর থ্রো করবে 

>>> 'I\'m fine!'  # এই এরর থেকে বাচার উপায় হল ব্যাকস্ল্যাশ (\) এটাকে এস্কেপ ক্যারেকটার বলে, স্ট্রিং এর মধ্যে এটা থাকলে এর 
"I'm fine!"       # পরের অক্ষরটা এস্কেপ হয়, অর্থাৎ সেটাকে পাইথন ইন্টারপ্রেটার আর সাধারন ভাবে গ্রহণ করেনা!